{
  "architectures": ["ResNetForImageClassification"],
  "model_type": "resnet",
  "num_labels": 10,
  "image_size": 32,
  "num_channels": 3,
  "layer_type": "basic",
  "depth": 18,
  "id2label": {
    "0": "airplane",
    "1": "automobile",
    "2": "bird",
    "3": "cat",
    "4": "deer",
    "5": "dog",
    "6": "frog",
    "7": "horse",
    "8": "ship",
    "9": "truck"
  },
  "label2id": {
    "airplane": 0,
    "automobile": 1,
    "bird": 2,
    "cat": 3,
    "deer": 4,
    "dog": 5,
    "frog": 6,
    "horse": 7,
    "ship": 8,
    "truck": 9
  }
}
